app/controllers/expansions_controller.rb

SELECT "expansions".* FROM "expansions"
---
  def index
    @expansions = Expansion.all