app/controllers/raids_controller.rb

SELECT "raids".* FROM "raids"
---
  def index
    @raids = Raid.all