app/controllers/requests_controller.rb

SELECT "requests".* FROM "requests"
---
  def index
    @requests = Request.all

SELECT  "requests".* FROM "requests" WHERE "requests"."group_id" = $1 LIMIT $2  [["group_id", 1], ["LIMIT", 1]]
---
  def show
    @requests = Request.where(group_id:params[:id])

UPDATE "requests" SET "status" = $1, "updated_at" = $2 WHERE "requests"."id" = $3  [["status", "accepted"], ["updated_at", "2017-09-22 03:32:21.923813"], ["id", 1]]
INSERT INTO "ledgers" ("group_id", "character_id", "spec_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["group_id", 1], ["character_id", 4], ["spec_id", 10], ["created_at", "2017-09-22 03:25:20.542756"], ["updated_at", "2017-09-22 03:25:20.542756"]]
---
  def accept
    ledger_params = {group_id: @request.group_id, character_id: @request.character_id, spec_id: @request.spec_id}
    @ledger = Ledger.new(ledger_params)
    @request.update({status: "accepted"})

    if @ledger.save

UPDATE "requests" SET "status" = $1, "updated_at" = $2 WHERE "requests"."id" = $3  [["status", "rejected"], ["updated_at", "2017-09-22 03:34:10.345562"], ["id", 1]]
---
  def reject
    @request.update({status: "rejected"})

INSERT INTO "requests" ("group_id", "character_id", "role", "spec_id", "note", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6, $7) RETURNING "id"  [["group_id", 1], ["character_id", 3], ["role", "DPS"], ["spec_id", "7"], ["note", "xzczxc"], ["created_at", "2017-09-21 23:31:50.367981"], ["updated_at", "2017-09-21 23:31:50.367981"]]
---
  def create
    @request = Request.new(request_params)

    if @request.save

SELECT  "requests".* FROM "requests" WHERE "requests"."id" = $1 LIMIT $2  [["id", nil], ["LIMIT", 1]]
---
    def set_request
      @request = Request.find(params[:id])