app/controllers/specs_controller.rb

  def index
    @specs = Spec.all
---
SELECT "specs".* FROM "specs"