app/controllers/users_controller.rb

SELECT  "users".* FROM "users" WHERE "users"."username" = $1 LIMIT $2  [["username", "aaron"], ["LIMIT", 1]]
---
  def login
    user = User.find_by(username: params[:user][:username])

SELECT  "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
---
  def currentUser
    user_id = get_current_user.id

    @user = User.find(user_id)